# Напишите функцию для транспонирования матрицы


def matrix_transposition(matr):
    result_matrix = matr
    print(result_matrix)
    return result_matrix


matrix = [[1, 2, 5],
          [2, 7, 8],
          [87, 66, 3]]

trans_matrix = matrix_transposition(matrix)
